Revit 2017 API
StructuralSectionConcreteRound Properties
The StructuralSectionConcreteRound type exposes the following members.
Properties
Name | Description
CentroidHorizontal
 Distance from centroid to the left extremites along horizontal axis.
 (Inherited from StructuralSectionRound.)
CentroidVertical
 Distance from centroid to the upper extremites along vertical axis.
 (Inherited from StructuralSectionRound.)
Diameter
 Pipe Diameter.
 (Inherited from StructuralSectionRound.)
ElasticModulusStrongAxis
 Elastic section modulus about main strong axis for calculation of bending stresses.
 (Inherited from StructuralSectionRound.)
ElasticModulusWeakAxis
 Elastic section modulus about main weak axis for calculation of bending stresses.
 (Inherited from StructuralSectionRound.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from StructuralSection.)
MomentOfInertiaStrongAxis
 Moment of Inertia about main strong axis (I).
 (Inherited from StructuralSectionRound.)
MomentOfInertiaWeakAxis
 Moment of Inertia about main weak axis (I).
 (Inherited from StructuralSectionRound.)
NameKey
 Name Key
 (Inherited from StructuralSectionRound.)
NominalWeight
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
 (Inherited from StructuralSectionRound.)
Perimeter
 Painting surface of the unit length.
 (Inherited from StructuralSectionRound.)
PlasticModulusStrongAxis
 Plastic section modulus in bending about main strong axis (Z, Wpl)
 (Inherited from StructuralSectionRound.)
PlasticModulusWeakAxis
 Plastic section modulus in bending about main weak axis.
 (Inherited from StructuralSectionRound.)
PrincipalAxesAngle
 Rotation angle between the principal axes and cross section reference planes.
 (Inherited from StructuralSectionRound.)
SectionArea
 Cross section area.
 (Inherited from StructuralSectionRound.)
SectionNameKey
 A parameter in structural families which allows for family type identification. This will be used for data mapping during model exchange with another program, namely Advance Steel.
 (Inherited from StructuralSection.)
ShearAreaStrongAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
 (Inherited from StructuralSectionRound.)
ShearAreaWeakAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
 (Inherited from StructuralSectionRound.)
StructuralSectionShape
 The type of structural section shape.
 (Inherited from StructuralSection.)
StructuralSectionShapeName
 A human readable string representing the structural section shape.
 (Inherited from StructuralSection.)
TorsionalModulus
 Section modulus for calculations of torsion stresses (Ct)
 (Inherited from StructuralSectionRound.)
TorsionalMomentOfInertia
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
 (Inherited from StructuralSectionRound.)
WarpingConstant
 Warping constant (Cw, Iomega, H)
 (Inherited from StructuralSectionRound.)
See Also
StructuralSectionConcreteRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace